app/controllers/everythinglist_controller.rb

  def index
    @lists = List.find(:all)
---
SELECT * FROM `lists` WHERE (`lists`.`id` = 1)