app/controllers/everythinglist_controller.rb

  def index
    @lists = List.search(params[:search])
---
SELECT * FROM `lists`