app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM `items`

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 3)

  def create
    @item = Item.new(params[:item])
    @product = List.find((params[:item])[:list_id])
    respond_to do |format|
      if @item.save
---
SELECT * FROM `lists` WHERE (`lists`.`id` = 0)
INSERT INTO `items` (`name`, `comment`, `completed_at`, `position`, `created_at`, `completed`, `updated_at`, `list_id`, `description`) VALUES('', '', '2009-04-09 01:43:00', NULL, '2009-04-09 01:43:00', 0, '2009-04-09 01:43:00', NULL, '')

  def destroy
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT * FROM `items` WHERE (`items`.`id` = 1)
DELETE FROM `items` WHERE `id` = 1