app/controllers/lists_controller.rb

SELECT * FROM `lists`
---
  def index
    @lists = List.all

SELECT * FROM `lists` WHERE (`lists`.`id` = 1)
---
  def show
    @list = List.find(params[:id])

INSERT INTO `lists` (`name`, `created_at`, `updated_at`, `description`) VALUES('Senthoor\'s Plate', '2009-04-09 12:47:00', '2009-04-09 12:47:00', 'Senthoor\'s Task List')
---
  def create
    @list = List.new(params[:list])

    respond_to do |format|
      if @list.save